Autodesk.Navisworks.Api.GridsData
The Grids data as returned by DocumentGrids.Value.

Autodesk.Navisworks.Api.GridsData.#ctor(Autodesk.Navisworks.Api.GridsData)
Copy constructor
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed

Autodesk.Navisworks.Api.GridsData.ActiveSystem
The Active Grid System
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'system' has been Disposed
Throws System.ArgumentNullException:
Argument 'system' is null

Autodesk.Navisworks.Api.GridsData.CreateCopy
Create a new copy of this item
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridsData.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.GridsData.RenderMode
The render mode for grids and levels.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.GridsData.Systems
The collection of all GridSystems within the Document.